In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

### 03. Import new customer data

In [2]:
# Import  customer data
path = r"C:\Users\e0280497\Documents\Python\Instacart Basket Analysis"
customers= pd.read_csv(os.path.join(path,'02 Data','Original Data', 'customers.csv'), index_col = False)

In [4]:
# Import the rest of Instacard Data
ords_prods_prep= pd.read_pickle(os.path.join(path,'02 Data', 'Prepared Data','ords_prods_agg.pkl'))

### 04. Wrangle the data so that it follows consistent logic

In [5]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
# Rename / Format columns
customers.rename(columns={'First Name' : 'first_name'}, inplace = True)
customers.rename(columns={'Surnam' : 'last_name'}, inplace = True)
customers.rename(columns={'Gender' : 'gender'}, inplace = True)
customers.rename(columns={'STATE' : 'state'}, inplace = True)
customers.rename(columns={'Age' : 'age'}, inplace = True)
customers.rename(columns={'fam_status' : 'marital_status'}, inplace = True)
customers.rename(columns={'n_dependants' : 'number_of_dependants'}, inplace = True)

In [7]:
customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
customers.shape

(206209, 10)

### 05. Complete the fundamental data quality and consistency checks

In [9]:
customers.describe()

             user_id            age  number_of_dependants         income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [10]:
# Check data type 
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int64
 1   first_name            194950 non-null  object
 2   last_name             206209 non-null  object
 3   gender                206209 non-null  object
 4   state                 206209 non-null  object
 5   age                   206209 non-null  int64
 6   date_joined           206209 non-null  object
 7   number_of_dependants  206209 non-null  int64
 8   marital_status        206209 non-null  object
 9   income                206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [ ]:
# Change types for customers data set 

customers['user_id'] =customers['user_id'].astype('int32')
customers['age'] =customers['age'].astype('int32')
customers['number_of_dependants'] =customers['number_of_dependants'].astype('int32')
customers['income'] = customers['income'].astype('int32')

In [11]:
# Change user_id to string
customers['user_id'] = customers['user_id'].astype('str')

In [12]:
# Check for mixed types
for col in customers.columns.tolist():
    weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (customers[weird]) > 0:
        print (col)

first_name

In [13]:
# Fix the mixed-type columns
customers['first_name'] = customers['first_name'].astype('str')

In [14]:
# Find missing values
customers.isnull().sum()

user_id                 0
first_name              0
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
marital_status          0
income                  0
dtype: int64

In [15]:
# Find duplicates
df_dups= customers[customers.duplicated()]

In [16]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependants, marital_status, income]
Index: []

In [17]:
customers['first_name'].value_counts()

nan        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: first_name, Length: 208, dtype: int64

In [18]:
customers.isnull().sum()

user_id                 0
first_name              0
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
marital_status          0
income                  0
dtype: int64

### 06. Combine your customer data with the rest of your prepared Instacart data

In [19]:
ords_prods_prep.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag,median_days,frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Mid-range product,Regularly busy,Regularly busy days,Average orders,10,New Customer,6.367797,Low Spender,20.5,Non-frequent Customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Mid-range product,Regularly busy,Least busy days,Average orders,10,New Customer,6.367797,Low Spender,20.5,Non-frequent Customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Mid-range product,Regularly busy,Least busy days,Most orders,10,New Customer,6.367797,Low Spender,20.5,Non-frequent Customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Mid-range product,Least busy,Least busy days,Average orders,10,New Customer,6.367797,Low Spender,20.5,Non-frequent Customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Mid-range product,Least busy,Least busy days,Most orders,10,New Customer,6.367797,Low Spender,20.5,Non-frequent Customer

In [24]:
ords_prods_prep.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_last_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', '_merge', 'price_range_loc', 'busiest_day',
       'busiest_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'avg_price', 'spending_flag', 'median_days', 'frequency_flag'],
      dtype='object')

In [27]:
ords_prods_prep=ords_prods_prep.drop(columns = ['_merge'])

In [28]:
ords_prods_prep.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32433030 entries, 0 to 32433029
Data columns (total 23 columns):
 #   Column                 Dtype
---  ------                 -----
 0   order_id               int64
 1   user_id                object
 2   order_number           int64
 3   orders_day_of_week     int64
 4   order_hour_of_day      int64
 5   days_since_last_order  float64
 6   product_id             int64
 7   add_to_cart_order      int64
 8   reordered              int64
 9   product_name           object
 10  aisle_id               int64
 11  department_id          int64
 12  prices                 float64
 13  price_range_loc        object
 14  busiest_day            object
 15  busiest_days           object
 16  busiest_period_of_day  object
 17  max_order              int64
 18  loyalty_flag           object
 19  avg_price              float64
 20  spending_flag          object
 21  median_days            float64
 22  frequency_flag         object
dtypes: float64(4), int64(10), object(9)
memory usage: 5.8+ GB

In [29]:
ords_prods_prep['user_id'] = ords_prods_prep['user_id'].astype('str')

In [30]:
# Combine customer data to the prepared Instacart data
ords_prods_cust=ords_prods_prep.merge(customers, on = ['user_id'], indicator = True)

In [31]:
# Check merge results
ords_prods_cust['_merge'].value_counts()

both          32433030
left_only            0
right_only           0
Name: _merge, dtype: int64

In [32]:
ords_prods_prep.shape

(32433030, 23)

In [33]:
ords_prods_cust.shape

(32433030, 33)

In [34]:
# Export data to pkl
ords_prods_cust.to_pickle(os.path.join(path,'02 Data','Prepared Data','ords_prods_cust.pkl'))